{
  "versions": {
    "3": {
      "6": {
        "4": [
          "Added the top.gg token so that the bot stats can be on the website",
          "Added this changelog file for future use so people can read the changelogs, past and preset."
        ]
      },
      "7": {
        "0": [
          "Added changelog command use with n!changelog",
          "Added custom prefix ability use with n!setPrefix",
          "Added an easter egg!",
          "If you find issues with the bot or have suggestions you can always send them in the server's respective channels!"
        ],
        "1": [
          "Fixed a bug that would cause the bot to crash"
        ],
        "2": [
          "Actually fixed the bug that caused the bot crash"
        ],
        "3": [
          "Removed the very in-your-face error message that the changelog command would give if an incorrect version was specified",
          "Also may or may not have kept it in as an easter egg"
        ],
        "4": [
          "Fixed a bug with the prefix command breaking the bot",
          "Made the prefix length a max of 5 characters",
          "*Finally* made the bot check the user who runs the n!check command if left blank",
          "Added a small feature relating to an EE",
          "Changed a few commands to have different aliases"
        ],
        "5": [
          "Fixed an issue where server names would not be saved when the bot joined a new server"
        ],
        "6": [
          "Optimized the the previous fix"
        ],
        "7": [
          "Added a link to the support server in the help file",
          "Direct Messaging the bot 'help' or 'n!help' will give you the help file",
          "Fixed a typo in the help file",
          "Changed the embed color for the changelog error response",
          "Added a forced cooldown for people spamming way too much"
        ],
        "8": [
          "Made the n!global command a bit faster"
        ]
      },
      "8": {
        "0": [
          "Added achievements that can be earned when an easter egg is found",
          "Fixed a problem that would cause the bot to give errors when posting the server count to top.gg",
          "DMing the bot `help` or `n!help` is no longer case sensitive",
          "Fixed a few grammar errors :>",
          "Significantly decreased the time it takes for n!global to respond",
          "Removed the server names from the global leaderboard",
          "Fixed bottom user",
          "Removed blacklist"
        ],
        "1":[
          "Fixed bug where the bot would not add a server to the database when it joined",
          "Fixed the leaderboards not showing the top ten properly if people had left the server",
          "You can now check yours and others achievements with n!ach instead of the garbage that used to be n!achievements cuz that was god awful to type out everytime",
          "Made n!check work better and it will also display your total tracked words too"
        ]
      }
    }
  }
}
